var _U = {

	"sign_terms" : [
		"Този документ, когато бъде подписан, става официален правен документ.",
		"С подписването на този документ вие сте правно обвързани с неговия контекст и приемате всяко правно последствие, което може да генерира.",
		"Всяко копие на този документ е равностойно на оригинала си. Бъдете допълнително внимателни, когато давате копия.",
		"Уверете се, че сте напълно запознати със съдържанието на този документ, преди да подпишете.",
		"Не се колебайте да потърсите помощ от правен съвет преди да подпишете."
	],
	"title_information" : "Информация",
	"title_fill_data" 	: "Попълнете празните полета!",
	"terms_and_signing" : "УСЛОВИЯ И ПОДПИСАНИЕ",
	"first_name" 		: "Първо име:",
	"last_name" 		: "Последно име:",
	"birth_date" 		: "Дата на раждане:",
	"occupation" 		: "Професия:"
}