Config = {}


-- allows for 3 different sql wrappers, mysql-async, ghmattisql, oxmysql
-- make sure you edit your fxmanifest if you plan on using somethin different than mysql-async.
-- see line 1268 for the function this relates to. everything is self explanatory.
Config.Mysql = 'oxmysql'

Config.Licenses = {
    'Weapon',
    'Drivers',
    'Hunting',
    'Fishing',
    'Bar',
    'Pilot',
}

Config['OffensesTitels'] = {
    [1] = 'Административни нарушения',
    [2] = 'Дребно хулиганство',
    [3] = 'Едро хулиганство',
    [4] = 'Нападение',
    [5] = 'Обири и тежки криминални прояви спрямо личността и спрямо обекти',
    [6] = 'Нелегални събития',
    [7] = 'Незаконно оръжие',
    [8] = 'Нелегални субстанции',
    [9] = 'Закон за движение по пътищата',
}

Config["Offenses"] = {
    [1] = {
        [1] = {title = 'Липса на лични документи', class = 'Административно нарушение', id = 'Чл. 1', months = 0, fine = 4000, color = 'green'},
        [2] = {title = 'Лъжесвидетелстване', class = 'Административно нарушение', id = 'Чл. 2', months = 9, fine = 2500, color = 'green'},
        [3] = {title = 'Документна измама', class = 'Административно нарушение', id = 'Чл. 3', months = 20, fine = 3000, color = 'green'},
        [4] = {title = 'Фалшифициране на документи', class = 'Административно нарушение', id = 'Чл. 3 Ал.1', months = 20, fine = 3000, color = 'green'},
        [5] = {title = 'Предоставяне на лични документи', class = 'Административно нарушение', id = 'Чл. 3 Ал.2', months = 20, fine = 2000, color = 'green'},
        [6] = {title = 'Злоупотреба с чужди лични документи', class = 'Административно нарушение', id = 'Чл. 3 Ал.3', months = 20, fine = 4000, color = 'green'},
        [7] = {title = 'Документна измама в големи размери', class = 'Административно нарушение', id = 'Чл. 3 Ал.4', months = 'Съд', fine = 'Съд', color = 'green'},
    },
    [2] = {
        [1] = {title = 'Злоупотреба с 911', class = 'Дребно хулиганство', id = 'Чл. 4', months = 0, fine = 700, color = 'orange'},
        [2] = {title = 'Непристойно поведение', class = 'Дребно хулиганство', id = 'Чл. 5', months = 0, fine = 700, color = 'orange'},
        [3] = {title = 'Увреждане на имущество', class = 'Дребно хулигаснтво', id = 'Чл. 6', months = 0, fine = 1500, color = 'orange'},
        [4] = {title = 'Арогантно поведение', class = 'Дребно хулигнаство', id = 'Чл. 7', months = 0, fine = 300, color = 'orange'},
        [5] = {title = 'Арогантно държание към служебно лице', class = 'Дребно хулиганство', id = 'Чл. 7 ал. 1', months = 0, fine = 1400, color = 'orange'},
        [6] = {title = 'Системно арогантно поведение', class = 'Дребно хулиганство', id = 'Чл.7 ал. 2', months = 0, fine = 2000, color = 'orange'},
        [7] = {title = 'Съпротива при арест', class = 'Дребно хулиганство', id = 'Чл. 8', months = 9, fine = 1500, color = 'orange'},
        [8] = {title = 'Незаконно разфасоване на МПС', class = 'Дребно хулиганство', id = 'Чл. 9', months = 10, fine = 1000, color = 'orange'},
        [9] = {title = 'Кражба на автомобил', class = 'Дребно хулиганство', id = 'Чл. 10', months = 10, fine = 1000, color = 'orange'},
        [10] = {title = 'Бягство от полицията', class = 'Дребно хулиганство', id = 'Чл. 11', months = 10, fine = 1000, color = 'orange'},
    },
    [3] = {
        [1] = {title = 'Нападение на физическо лице', class = 'Едро хулигансто', id = 'Чл. 12', months = 15, fine = 1000, color = 'red'},
        [2] = {title = 'Нападение с лека телесна повреда', class = 'Едро хулиганство', id = 'Чл. 12 Ал. 1', months = 10, fine = 2000, color = 'red'},
        [3] = {title = 'Нападение с тежка телесна повреда', class = 'Едро хулиганство', id = 'Чл. 12 Ал. 2', months = 15, fine = 3000, color = 'red'},
        [4] = {title = 'Физическо нападение на служебно лице', class = 'Едро хулиганство', id = 'Чл. 12 Ал. 3', months = 20, fine = 3000, color = 'red'},
    },
    [4] = {
        [1] = {title = 'Нападение с хладно оръжие', class = 'Едро хулиганство', id = 'Чл. 13', months = 18, fine = 8000, color = 'red'},
        [2] = {title = 'Нападение с хладно оръжие без последствия', class = 'Едро хулиганство', id = 'Чл. 13 Ал. 1', months = 7, fine = 3500, color = 'red'},
        [3] = {title = 'Нападение с хладно оръжие с последствия', class = 'Едро хулиганство', id = 'Чл. 13 Ал. 2', months = 18, fine = 8000, color = 'red'},
        [4] = {title = 'Нападение с хладно оръжие на служебно лице', class = 'Едро хулиганство', id = 'Чл. 13 Ал. 3', months = 18, fine = 8000, color = 'red'},
        [5] = {title = 'Нападение с оръжие Клас 1', class = 'Углавно престътпение', id = 'Чл. 14', months = 36, fine = 12000, color = 'red'},
        [6] = {title = 'Нападение с оръжие Клас 1 без последствия', class = 'Углавно престътпение', id = 'Чл. 14 Ал. 1', months = 18, fine = 6000, color = 'red'},
        [7] = {title = 'Нападение с оръжие Клас 1 със последствия', class = 'Углавно престътпение', id = 'Чл. 14 Ал. 2', months = 36, fine = 12000, color = 'red'},
        [8] = {title = 'Нападение с оръжие Клас 1 над служебно лице', class = 'Углавно престътпение', id = 'Чл. 14 Ал. 3', months = 18, fine = 12000, color = 'red'},
        [9] = {title = 'Нападение с оръжие Клас 2', class = 'Углавно престъпление', id = 'Чл. 15', months = 36, fine = 17000, color = 'red'},
        [10] = {title = 'Нападение с МПС', class = 'Углавно престъпление', id = 'Чл. 16', months = 36, fine = 12000, color = 'red'},
        [11] = {title = 'Нападение с МПС с нетрайни увреждания', class = 'Углавно престъпление', id = 'Чл. 16 Ал.1', months = 18, fine = 6000, color = 'red'},
        [12] = {title = 'Нападение с МПС с трайни увреждания', class = 'Углавно престъпление', id = 'Чл. 16 Ал.2', months = 36, fine = 12000, color = 'red'},
        [13] = {title = 'Нападение с МПС срещу служебно лице', class = 'Углавно престъпление', id = 'Чл. 16 Ал.3', months = 18, fine = 12000, color = 'red'},
    },
    [5] = {
        [1] = {title = 'Влизане с взлом в имущество', class = 'Углавно престъпление', id = 'Чл. 17', months = 12, fine = 2500, color = 'red'},
        [2] = {title = 'Кражба от физически лица', class = 'Углавно престъпление', id = 'Чл. 18', months = 12, fine = 2000, color = 'red'},
        [3] = {title = 'Грабеж на валута или имущество от търговски обект', class = 'Углавно престъпление', id = 'Чл. 19', months = 30, fine = 3500, color = 'red'},
        [4] = {title = 'Невъоръжен грабеж на стоки', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 1', months = 16, fine = 2000, color = 'red'},
        [5] = {title = 'Невъоръжен грабеж на валута', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 2', months = 24, fine = 2500, color = 'red'},
        [6] = {title = 'Въоръжен грабеж на стоки', class = 'Углавно престъпление', id = 'Чл. 19 Ал.3', months = 16, fine = 3000, color = 'red'},
        [7] = {title = 'Въоръжен грабеж на валута', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 4', months = 24, fine = 3500, color = 'red'},
        [8] = {title = 'Обир на клон на банка', class = 'Углавно престъпление', id = 'Чл. 19 Ал.5', months = 48, fine = 7000, color = 'red'},
        [9] = {title = 'Обир на регионална централа на банка', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 6', months = 72, fine = 20000, color = 'red'},
        [10] = {title = 'Крупен обир на частен обект', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 7', months = 48, fine = 6000, color = 'red'},
        [11] = {title = 'Крупен обир на търговски обект', class = 'Углавно престъпление', id = 'Чл. 19 Ал. 8', months = 48, fine = 10000, color = 'red'},
        [12] = {title = 'Нахлуване в забранена зона', class = 'Углавно престъпление', id = 'Чл. 20', months = 20, fine = 5000, color = 'red'},
        [13] = {title = 'Подпомагане на нахлуване в забранена зона', class = 'Углавно престъпление', id = 'Чл. 20 Aл. 1', months = 10, fine = 3000, color = 'red'},
        [14] = {title = 'Кражба и/или възползване от МПС със специален режим на движение', class = 'Углавно престъпление', id = 'Чл. 20 Aл. 2', months = 15, fine = 3000, color = 'red'},
        [15] = {title = 'Отвличане и/или задържане на лице', class = 'Углавно престъпление', id = 'Чл. 21', months = 40, fine = 10000, color = 'red'},
        [16] = {title = 'Отвличане и/или задържане на цивилно лице', class = 'Углавно престъпление', id = 'Чл. 21 Ал. 1', months = 20, fine = 5000, color = 'red'},
        [17] = {title = 'Отвличане и/или задържане на служебно лице', class = 'Углавно престъпление', id = 'Чл. 21 Ал. 2', months = 40, fine = 10000, color = 'red'},
        [18] = {title = 'Терористични действия', class = 'Углавно престъпление', id = 'Чл. 22', months = 100, fine = 30000, color = 'red'},
    },
    [6] = {
        [1] = {title = 'Нелегални събития', class = 'Углавно престъпление', id = 'Чл. 23', months = 0, fine = 15000, color = 'red'},
        [2] = {title = 'Участие в нелегални събития', class = 'Углавно престъпление', id = 'Чл. 23 Ал. 1', months = 18, fine = 7000, color = 'red'},
        [3] = {title = 'Организиране нелегални събития', class = 'Углавно престъпление', id = 'Чл. 23 Ал. 2', months = 18, fine = 15000, color = 'red'},
    },
    [7] = {
        [1] = {title = 'Притежание на огнестрелно оръжие без лиценз', class = 'Углавно престъпление', id = 'Чл. 24', months = 60, fine = 20000, color = 'red'},
        [2] = {title = 'Притежание на огнестрелно оръжие Клас 1', class = 'Углавно престъпление', id = 'Чл. 24 Ал. 1', months = 30, fine = 3000, color = 'red'},
        [3] = {title = 'Притежание на огнестрелно оръжие Клас 2', class = 'Углавно престъпление', id = 'Чл. 24 Ал. 2', months = 30, fine = 7000, color = 'red'},
        [4] = {title = 'Притежание на огнестрелно оръжие Клас Police', class = 'Углавно престъпление', id = 'Чл. 24 Ал. 3', months = 60, fine = 20000, color = 'red'},
    },
    [8] = {
        [1] = {title = 'Нелегални субстанции в МПС', class = 'Углавно престъпление', id = 'Чл. 25', months = 5, fine = 150, color = 'red'},
        [2] = {title = 'Производство и преработка на нелегални субстанции', class = 'Углавно престъпление', id = 'Чл 26', months = 60, fine = 15000, color = 'red'},
        [3] = {title = 'Притежание и разпространение до 20 гр.', class = 'Углавно пресъпление', id = 'Чл 27', months = 15, fine = 1800, color = 'red'},
        [4] = {title = 'Притежание и разпространение над 20 гр.', class = 'Углавно пресъпление', id = 'Чл 28', months = 15, fine = 3000, color = 'red'},
    },
    [9] = {
        [1] = {title = 'Управлява МПС без СУМПС', class = 'Административно нарушение', id = 'Чл. 1 от ЗДвП', months = 0, fine = 1000, color = 'green'},
        [2] = {title = 'Несъобразяване EMS сигнал', class = 'Административно нарушение', id = 'Чл. 2 от ЗДвП', months = 0, fine = 1000, color = 'green'},
        [3] = {title = 'Агресивно шофиране', class = 'Административно нарушение', id = 'Чл. 3 от ЗДвП', months = 0, fine = 700, color = 'green'},
        [4] = {title = 'Шофиране с превишена скорост в населено място', class = 'Административно нарушение', id = 'Чл. 4 от ЗДвП', months = 0, fine = 1800, color = 'green'},
        [5] = {title = 'Шофиране с превишена скорост до 30 км/ч', class = 'Административно нарушение', id = 'Чл. 4 Ал. 1 от ЗДвП', months = 0, fine = 800, color = 'green'},
        [6] = {title = 'Шофиране с превишена скорост до 50 км/ч', class = 'Административно нарушение', id = 'Чл. 4 Ал. 2 от ЗДвП', months = 0, fine = 1200, color = 'green'},
        [7] = {title = 'Шофиране с превишена скорост над 80 км/ч', class = 'Административно нарушение', id = 'Чл. 4 Ал. 3 от ЗДвП', months = 0, fine = 1800, color = 'green'},
        [8] = {title = 'Превишена скорост извън населено място до 100 км/ч', class = 'Административно нарушение', id = 'Чл. 4 Ал. 4 от ЗДвП', months = 0, fine = 1300, color = 'green'},
        [9] = {title = 'Превишена скорост извън населено място над 100 км/ч', class = 'Административно нарушение', id = 'Чл. 4 Ал. 5 от ЗДвП', months = 0, fine = 1300, color = 'green'},
        [10] = {title = 'Липса на документи за МПС', class = 'Административно нарушение', id = 'Чл. 5 от ЗДвП', months = 0, fine = 1000, color = 'green'},
        [11] = {title = 'Затъмнен преден прозорец', class = 'Административно нарушение', id = 'Чл. 6 от ЗДвП', months = 0, fine = 2000, color = 'green'},
    }
}