Locales['en'] = {
	["inside"]  = "~g~E~s~ - Влез",
	["leave"]  = "~g~E~s~ - Излез",
	["empty"]  = "~r~Празно..",
	["robbing"]  = "~o~Обиране..",
	["steal"]  = "~g~E~s~ - Прерови",
	["evidence"]  = "Одра се и капна кръв",
	["toolkitmissing"]  = "Нямаш инструменти..",
	["nocops"]  = "Има хора вкъщи , бегай преди да са викнали куки!",
	["breaking"]  = "Разбиване..",
	["failed"]  = "Провали се..",
	["nothing"]  = "Не намери нищо",
	["searching"]  = "Търсене..",
	["nospace"]  = "Нямате място по джобовете..",
}
-- _U("cuffed") ..'
--                         _U("nothing")